In [1]:
import pandas as pd
#validete 1:1 m:1 1:m m:m muhabbetlerine girmedim.

In [7]:
a=pd.DataFrame({"company":["mic","google","ikea"],
                "department":["software","software","arch"],
                "worker":[500000,53000,7000]})
b=pd.DataFrame({"company":["mic","mic","google","google","google","ikea"],
                "department":["software","software","software","software","acc","arch"],
                "team_lead":["ali","hasan","mehmed","riza","tomris","kasim"]})
print(a)
print()
print(b)

  company department  worker
0     mic   software  500000
1  google   software   53000
2    ikea       arch    7000

  company department team_lead
0     mic   software       ali
1     mic   software     hasan
2  google   software    mehmed
3  google   software      riza
4  google        acc    tomris
5    ikea       arch     kasim

In [9]:
pd.merge(a,b)

  company department  worker team_lead
0     mic   software  500000       ali
1     mic   software  500000     hasan
2  google   software   53000    mehmed
3  google   software   53000      riza
4    ikea       arch    7000     kasim

In [10]:
pd.merge(a,b,on="company")

  company department_x  worker department_y team_lead
0     mic     software  500000     software       ali
1     mic     software  500000     software     hasan
2  google     software   53000     software    mehmed
3  google     software   53000     software      riza
4  google     software   53000          acc    tomris
5    ikea         arch    7000         arch     kasim